notes/meeting_2023mar05.org
* meeting notes March 5, 2023
** the raku study group
**** usual links
***** these notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023mar05.md
****** source file (for corrections, etc)
******* https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023mar05.org
***** code examples
****** https://github.com/doomvox/raku-study/tree/main/bin/2023mar05
***** last meeting notes
****** https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022feb26.md


** topics

*** IPC (david)
**** stdout/stderr/stdin

**** CAP vids from Jonathan Worthington
***** 8 ways to do concurrency and parallelism in Perl 6
****** https://www.youtube.com/watch?v=l2fSbOPeSQs

***** Parallelism, Concurrency, and Asynchrony in Perl 6
****** https://www.youtube.com/watch?v=JpqnNCx7wVY


*** pod6


*** the ever popular weekly challenge

***** https://theweeklychallenge.org/blog/perl-weekly-challenge-206/


*** jj merelo raku recipies code examples
**** https://github.com/Apress/raku-recipes



** announcements 
*** next meeting: March 26th
**** skipping two weeks this time
**** I'm going to be out-of-town for March 12 & 19

*** perl & raku conference (formerly yapc) will be in toronto on july 11th-13th


