notes/meeting_2023mar05.md
- [meeting notes March 5, 2023](#org51ddf4e)
  - [the raku study group](#org19c4052)
  - [topics](#org2b06c97)
    - [IPC (david)](#org7245fe6)
    - [pod6](#org03c943f)
    - [the ever popular weekly challenge](#orgcd8e695)
    - [jj merelo raku recipies code examples](#orgf19c94c)
  - [announcements](#org7c24d04)
    - [next meeting: March 26th](#orgdde1c57)
    - [perl & raku conference (formerly yapc) will be in toronto on july 11th-13th](#org61c433e)


<a id="org51ddf4e"></a>

# meeting notes March 5, 2023


<a id="org19c4052"></a>

## the raku study group

1.  usual links

    1.  these notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023mar05.md>
        
        2.  source file (for corrections, etc)
        
            1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2023mar05.org>
    
    2.  code examples
    
        1.  <https://github.com/doomvox/raku-study/tree/main/bin/2023mar05>
    
    3.  last meeting notes
    
        1.  <https://github.com/doomvox/raku-study/blob/main/notes/meeting_2022feb26.md>


<a id="org2b06c97"></a>

## topics


<a id="org7245fe6"></a>

### IPC (david)

1.  stdout/stderr/stdin

2.  CAP vids from Jonathan Worthington

    1.  8 ways to do concurrency and parallelism in Perl 6
    
        1.  <https://www.youtube.com/watch?v=l2fSbOPeSQs>
    
    2.  Parallelism, Concurrency, and Asynchrony in Perl 6
    
        1.  <https://www.youtube.com/watch?v=JpqnNCx7wVY>


<a id="org03c943f"></a>

### pod6


<a id="orgcd8e695"></a>

### the ever popular weekly challenge

1.  <https://theweeklychallenge.org/blog/perl-weekly-challenge-206/>


<a id="orgf19c94c"></a>

### jj merelo raku recipies code examples

1.  <https://github.com/Apress/raku-recipes>


<a id="org7c24d04"></a>

## announcements


<a id="orgdde1c57"></a>

### next meeting: March 26th

1.  skipping two weeks this time

2.  I'm going to be out-of-town for March 12 & 19


<a id="org61c433e"></a>

### perl & raku conference (formerly yapc) will be in toronto on july 11th-13th
